<%
'=======================================================================
' ローカルな日付・時間をフォーマットする
'=======================================================================
'【引数】
'  format   = string   フォーマット文字列
'【戻り値】
'  指定したフォーマット文字列に基づき文字列をフォーマットして返します。
'【処理】
'  ・設定にもとづいてフォーマットします。
'=======================================================================
Function strftime(format)
    Dim bobj : set bobj = Server.CreateObject("Basp21")
    strftime = bobj.strftime(format)
    set bobj = Nothing
End Function
%>
