<%
'=======================================================================
'変数の文字列としての値を得ます
'=======================================================================
'【引数】
'  str   = mixed 文字列に変換したい変数。str は、全てのスカラー値にできます。 strval() に配列あるいはオブジェクトは使用できません。
'【戻り値】
'  str文字列値を返します。
'【処理】
'  ・strのstring としての値を返します。
'=======================================================================
Function strval(ByVal str)

    strval = false
    If isArray(str) or isObject(str) Then Exit Function
    strval = Cstr(str)

End Function
%>
