<%
'=======================================================================
' 文字列をスラッシュでクォートする
'=======================================================================
'【引数】
'  str  = string    エスケープしたい文字列。
'【戻り値】
'  エスケープされた文字列を返します。
'【処理】
'  ・データベースへの問い合わせなどに際してクォートされるべき文字の前に バックスラッシュを挿入した文字列を返します。 
'=======================================================================
Function addslashes(ByVal str)

    If isNull(str) Then
        str = ""
    End If

    str = Replace(str,"¥","¥¥")
    str = Replace(str,"""","¥""")
    str = Replace(str,"'","¥'")

    addslashes = str

End Function
%>
