<%
'=======================================================================
' 1 つ以上の文字列を出力する
'=======================================================================
'【引数】
'  str  = string    出力したいパラメータ。
'【戻り値】
'  値を返しません。
'【処理】
'  ・すべてのパラメータを出力します。
'=======================================================================
Sub echo(str)

    If isObject(str) then
        Response.Write "Object"
    ElseIf IsArray(str) then
        Response.Write "Array"
    Else
        Response.Write str
    End if

End Sub
%>
