<%
'=======================================================================
' メタ文字をクォートする
'=======================================================================
'【引数】
'  format   = string 入力文字列。
'【戻り値】
'  メタ文字をクォートした文字列を返します。
'【処理】
'  ・ 文字列 str  について、. ¥ + * ? [ ^ ] ( $ ) の前にバックスラッシュ文字 (¥) でクォートして返します。
'=======================================================================
Function quotemeta(byVal str)

    Dim pattern : pattern = array("¥",".","+","*","?","[","^","]","$","(",")")

    Dim key
    For key = 0 to uBound(pattern)
        str = Replace(str, pattern(key),"¥" & pattern(key))
    Next
    quotemeta = str

End Function
%>
