<%
'=======================================================================
' 文字列をランダムにシャッフルする
'=======================================================================
'【引数】
'  str  = string    入力文字列。
'【戻り値】
'  シャッフルされた文字列を返します。
'【処理】
'  ・str_shuffle() は文字列をシャッフルします。
'  ・考えられるすべての順列のうちのひとつを作成します。
'=======================================================================
Function str_shuffle(str)

    If len( str ) = 0 Then Exit Function

    Dim tmp
    tmp = str_split(str,1)
    shuffle tmp
    str_shuffle = join(tmp,"")

End Function
%>
