<%
'=======================================================================
' 大文字小文字を区別しないバイナリセーフな文字列比較を行う
'=======================================================================
'【引数】
'  str1 =   string  最初の文字列。
'  str2 =   string  次の文字列。
'【戻り値】
'  str1  が str2  より小さい場合は負、str1  が str2  より大きい場合は正、等しい場合は 0 を返します。
'【処理】
'  ・大文字小文字を区別しないバイナリセーフな文字列比較を行います。
'=======================================================================
Function strcasecmp(str1, str2)
    strcasecmp = StrComp(str1,str2,vbTextCompare)
End Function
%>
