<%
'=======================================================================
' addslashes() でクォートされた文字列のクォート部分を取り除く
'=======================================================================
'【引数】
'  str  = string    元に戻したい文字列。
'【戻り値】
'  バックスラッシュが取り除かれた文字列を返します(¥'  が ' になるなど)。
'  2 つ並んだバックスラッシュ (¥¥) は 1 つのバックスラッシュ (¥) になります。
'【処理】
'  ・クォートされた文字列を元に戻します。
'=======================================================================
Function stripslashes(ByVal str)
    str = preg_replace("/¥¥(.)/","$1",str,"","")
    stripslashes = str
End Function
%>
