<%
'=======================================================================
'a が b に等しくない時に TRUE。
'=======================================================================
'【引数】
'  a    = mixed  値
'  b    = mixed  比較する値
'【戻り値】
'  aとbが等しくない場合にTRUE を、等しくない場合に FALSE を返します。
'【処理】
'  ・左辺と右辺を比較します。型は厳密にチェックしません。
'=======================================================================
Function [!=](a, b)

    If [==](a,b) Then
        [!=] = false
    Else
        [!=] = true
    End If

End Function
%>
